{"format": "graph-model", "generatedBy": "2.13.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input": {"name": "input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "6"}, {"size": "9"}]}}}, "outputs": {"output": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "9"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/SelectV2_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/zeros", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Const_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/SelectV2_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/ExpandDims", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Cast_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Constant_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Const_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "Func/StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/then/_19/output/_53", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transpose", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mul_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SelectV2_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/zeros_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Const_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Shape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/SelectV2_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Const_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Cast_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Constant_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Const_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/flatten_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transpose_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mul_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SelectV2_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/zeros_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Const_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Shape_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/SelectV2_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Const_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/ExpandDims_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Cast_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Constant_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Const_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Constant_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Where", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{}, {"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Cast_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/GatherV2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/zeros_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SelectV2_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/zeros_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Const_11", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Shape_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/SelectV2_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Const_10", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/ExpandDims_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Cast_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Constant_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Const_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Constant_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Where_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{}, {"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Cast_13", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/GatherV2_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/zeros_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SelectV2_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/zeros_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Const_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Shape_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/SelectV2_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Const_14", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/ExpandDims_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Cast_15", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Constant_22", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Const_16", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/SelectV2_21", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/zeros_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Const_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Shape_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/SelectV2_22", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Const_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/ExpandDims_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Cast_17", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Constant_26", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Const_19", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Constant_27", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Where_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{}, {"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Cast_18", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/GatherV2_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/zeros_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/SelectV2_25", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/zeros_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Const_22", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Shape_12", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/SelectV2_26", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Const_21", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/ExpandDims_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Cast_20", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Constant_31", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Const_23", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/flatten_2/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transpose_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mul_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/flatten_3/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/transpose_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "768"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mul_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/transpose_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "9"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mul_9", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "9"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Constant_33", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Constant_32", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/LogicalAnd_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_5/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_5/All", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/LogicalAnd_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_3/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_3/All", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/pivot_t/_23", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/LogicalAnd", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_1/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_1/All", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "input", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "6"}, {"size": "9"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/SparseToDense", "op": "SparseToDense", "input": ["StatefulPartitionedCall/ExpandDims", "StatefulPartitionedCall/Cast_1", "StatefulPartitionedCall/SelectV2_1", "StatefulPartitionedCall/zeros"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/SparseToDense_1", "op": "SparseToDense", "input": ["StatefulPartitionedCall/ExpandDims", "StatefulPartitionedCall/Cast_1", "StatefulPartitionedCall/SelectV2_2", "StatefulPartitionedCall/Const"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/SparseToDense_2", "op": "SparseToDense", "input": ["StatefulPartitionedCall/ExpandDims", "StatefulPartitionedCall/Cast_1", "StatefulPartitionedCall/onnx_tf_prefix_/Constant_3", "StatefulPartitionedCall/Const_2"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/SparseToDense_3", "op": "SparseToDense", "input": ["StatefulPartitionedCall/ExpandDims_1", "StatefulPartitionedCall/Cast_5", "StatefulPartitionedCall/SelectV2_5", "StatefulPartitionedCall/zeros_1"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/SparseToDense_4", "op": "SparseToDense", "input": ["StatefulPartitionedCall/ExpandDims_1", "StatefulPartitionedCall/Cast_5", "StatefulPartitionedCall/SelectV2_6", "StatefulPartitionedCall/Const_3"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/SparseToDense_5", "op": "SparseToDense", "input": ["StatefulPartitionedCall/ExpandDims_1", "StatefulPartitionedCall/Cast_5", "StatefulPartitionedCall/onnx_tf_prefix_/Constant_8", "StatefulPartitionedCall/Const_5"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/SparseToDense_6", "op": "SparseToDense", "input": ["StatefulPartitionedCall/ExpandDims_2", "StatefulPartitionedCall/Cast_9", "StatefulPartitionedCall/SelectV2_9", "StatefulPartitionedCall/zeros_2"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/SparseToDense_7", "op": "SparseToDense", "input": ["StatefulPartitionedCall/ExpandDims_2", "StatefulPartitionedCall/Cast_9", "StatefulPartitionedCall/SelectV2_10", "StatefulPartitionedCall/Const_6"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/SparseToDense_8", "op": "SparseToDense", "input": ["StatefulPartitionedCall/ExpandDims_2", "StatefulPartitionedCall/Cast_9", "StatefulPartitionedCall/onnx_tf_prefix_/Constant_12", "StatefulPartitionedCall/Const_8"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/SparseToDense_9", "op": "SparseToDense", "input": ["StatefulPartitionedCall/Where", "StatefulPartitionedCall/Cast_10", "StatefulPartitionedCall/GatherV2", "StatefulPartitionedCall/zeros_3"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/SparseToDense_10", "op": "SparseToDense", "input": ["StatefulPartitionedCall/ExpandDims_3", "StatefulPartitionedCall/Cast_12", "StatefulPartitionedCall/SelectV2_13", "StatefulPartitionedCall/zeros_4"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/SparseToDense_11", "op": "SparseToDense", "input": ["StatefulPartitionedCall/ExpandDims_3", "StatefulPartitionedCall/Cast_12", "StatefulPartitionedCall/SelectV2_14", "StatefulPartitionedCall/Const_10"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/SparseToDense_12", "op": "SparseToDense", "input": ["StatefulPartitionedCall/ExpandDims_3", "StatefulPartitionedCall/Cast_12", "StatefulPartitionedCall/onnx_tf_prefix_/Constant_17", "StatefulPartitionedCall/Const_12"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/SparseToDense_13", "op": "SparseToDense", "input": ["StatefulPartitionedCall/Where_1", "StatefulPartitionedCall/Cast_13", "StatefulPartitionedCall/GatherV2_1", "StatefulPartitionedCall/zeros_5"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/SparseToDense_14", "op": "SparseToDense", "input": ["StatefulPartitionedCall/ExpandDims_4", "StatefulPartitionedCall/Cast_15", "StatefulPartitionedCall/SelectV2_17", "StatefulPartitionedCall/zeros_6"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/SparseToDense_15", "op": "SparseToDense", "input": ["StatefulPartitionedCall/ExpandDims_4", "StatefulPartitionedCall/Cast_15", "StatefulPartitionedCall/SelectV2_18", "StatefulPartitionedCall/Const_14"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/SparseToDense_16", "op": "SparseToDense", "input": ["StatefulPartitionedCall/ExpandDims_4", "StatefulPartitionedCall/Cast_15", "StatefulPartitionedCall/onnx_tf_prefix_/Constant_22", "StatefulPartitionedCall/Const_16"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/SparseToDense_17", "op": "SparseToDense", "input": ["StatefulPartitionedCall/ExpandDims_5", "StatefulPartitionedCall/Cast_17", "StatefulPartitionedCall/SelectV2_21", "StatefulPartitionedCall/zeros_7"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/SparseToDense_18", "op": "SparseToDense", "input": ["StatefulPartitionedCall/ExpandDims_5", "StatefulPartitionedCall/Cast_17", "StatefulPartitionedCall/SelectV2_22", "StatefulPartitionedCall/Const_17"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/SparseToDense_19", "op": "SparseToDense", "input": ["StatefulPartitionedCall/ExpandDims_5", "StatefulPartitionedCall/Cast_17", "StatefulPartitionedCall/onnx_tf_prefix_/Constant_26", "StatefulPartitionedCall/Const_19"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/SparseToDense_20", "op": "SparseToDense", "input": ["StatefulPartitionedCall/Where_2", "StatefulPartitionedCall/Cast_18", "StatefulPartitionedCall/GatherV2_2", "StatefulPartitionedCall/zeros_8"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/SparseToDense_21", "op": "SparseToDense", "input": ["StatefulPartitionedCall/ExpandDims_6", "StatefulPartitionedCall/Cast_20", "StatefulPartitionedCall/SelectV2_25", "StatefulPartitionedCall/zeros_9"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/SparseToDense_22", "op": "SparseToDense", "input": ["StatefulPartitionedCall/ExpandDims_6", "StatefulPartitionedCall/Cast_20", "StatefulPartitionedCall/SelectV2_26", "StatefulPartitionedCall/Const_21"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/SparseToDense_23", "op": "SparseToDense", "input": ["StatefulPartitionedCall/ExpandDims_6", "StatefulPartitionedCall/Cast_20", "StatefulPartitionedCall/onnx_tf_prefix_/Constant_31", "StatefulPartitionedCall/Const_23"], "attr": {"Tindices": {"type": "DT_INT64"}, "T": {"type": "DT_INT64"}, "validate_indices": {"b": true}}}, {"name": "StatefulPartitionedCall/assert_equal_5/Assert/AssertGuard/StatefulPartitionedCall/assert_equal_5/All/_44", "op": "Switch", "input": ["StatefulPartitionedCall/assert_equal_5/All", "StatefulPartitionedCall/assert_equal_5/All"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_5/Assert/AssertGuard/StatefulPartitionedCall/LogicalAnd_2/_45", "op": "Switch", "input": ["StatefulPartitionedCall/LogicalAnd_2", "StatefulPartitionedCall/assert_equal_5/All"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_5/Assert/AssertGuard/StatefulPartitionedCall/assert_equal_5/y/_46", "op": "Switch", "input": ["StatefulPartitionedCall/assert_equal_5/y", "StatefulPartitionedCall/assert_equal_5/All"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/StatefulPartitionedCall/assert_equal_3/All/_34", "op": "Switch", "input": ["StatefulPartitionedCall/assert_equal_3/All", "StatefulPartitionedCall/assert_equal_3/All"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/StatefulPartitionedCall/LogicalAnd_1/_35", "op": "Switch", "input": ["StatefulPartitionedCall/LogicalAnd_1", "StatefulPartitionedCall/assert_equal_3/All"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/StatefulPartitionedCall/assert_equal_3/y/_36", "op": "Switch", "input": ["StatefulPartitionedCall/assert_equal_3/y", "StatefulPartitionedCall/assert_equal_3/All"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/StatefulPartitionedCall/assert_equal_1/All/_24", "op": "Switch", "input": ["StatefulPartitionedCall/assert_equal_1/All", "StatefulPartitionedCall/assert_equal_1/All"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/StatefulPartitionedCall/LogicalAnd/_25", "op": "Switch", "input": ["StatefulPartitionedCall/LogicalAnd", "StatefulPartitionedCall/assert_equal_1/All"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/StatefulPartitionedCall/assert_equal_1/y/_26", "op": "Switch", "input": ["StatefulPartitionedCall/assert_equal_1/y", "StatefulPartitionedCall/assert_equal_1/All"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/switch_pred/_21", "op": "Switch", "input": ["StatefulPartitionedCall/assert_equal_1/All", "StatefulPartitionedCall/assert_equal_1/All"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/Equal", "op": "Equal", "input": ["StatefulPartitionedCall/SparseToDense_1", "StatefulPartitionedCall/Const_1"], "attr": {"T": {"type": "DT_INT64"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/Equal_1", "op": "Equal", "input": ["StatefulPartitionedCall/SparseToDense_4", "StatefulPartitionedCall/Const_4"], "attr": {"T": {"type": "DT_INT64"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/Equal_2", "op": "Equal", "input": ["StatefulPartitionedCall/SparseToDense_7", "StatefulPartitionedCall/Const_7"], "attr": {"T": {"type": "DT_INT64"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/add_13", "op": "AddV2", "input": ["StatefulPartitionedCall/onnx_tf_prefix_/Constant_13", "StatefulPartitionedCall/SparseToDense_9"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Equal_4", "op": "Equal", "input": ["StatefulPartitionedCall/SparseToDense_11", "StatefulPartitionedCall/Const_11"], "attr": {"T": {"type": "DT_INT64"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/add_17", "op": "AddV2", "input": ["StatefulPartitionedCall/onnx_tf_prefix_/Constant_18", "StatefulPartitionedCall/SparseToDense_13"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Equal_6", "op": "Equal", "input": ["StatefulPartitionedCall/SparseToDense_15", "StatefulPartitionedCall/Const_15"], "attr": {"T": {"type": "DT_INT64"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/Equal_7", "op": "Equal", "input": ["StatefulPartitionedCall/SparseToDense_18", "StatefulPartitionedCall/Const_18"], "attr": {"T": {"type": "DT_INT64"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/add_24", "op": "AddV2", "input": ["StatefulPartitionedCall/onnx_tf_prefix_/Constant_27", "StatefulPartitionedCall/SparseToDense_20"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/Equal_9", "op": "Equal", "input": ["StatefulPartitionedCall/SparseToDense_22", "StatefulPartitionedCall/Const_22"], "attr": {"T": {"type": "DT_INT64"}, "incompatible_shape_error": {"b": true}}}, {"name": "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/pivot_f/_22", "op": "Identity", "input": ["StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/switch_pred/_21"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/SelectV2_3", "op": "SelectV2", "input": ["StatefulPartitionedCall/Equal", "StatefulPartitionedCall/Shape", "StatefulPartitionedCall/SparseToDense_1"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/SelectV2_7", "op": "SelectV2", "input": ["StatefulPartitionedCall/Equal_1", "StatefulPartitionedCall/Shape_1", "StatefulPartitionedCall/SparseToDense_4"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/SelectV2_11", "op": "SelectV2", "input": ["StatefulPartitionedCall/Equal_2", "StatefulPartitionedCall/Shape_2", "StatefulPartitionedCall/SparseToDense_7"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/SelectV2_15", "op": "SelectV2", "input": ["StatefulPartitionedCall/Equal_4", "StatefulPartitionedCall/Shape_5", "StatefulPartitionedCall/SparseToDense_11"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/SelectV2_19", "op": "SelectV2", "input": ["StatefulPartitionedCall/Equal_6", "StatefulPartitionedCall/Shape_8", "StatefulPartitionedCall/SparseToDense_15"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/SelectV2_23", "op": "SelectV2", "input": ["StatefulPartitionedCall/Equal_7", "StatefulPartitionedCall/Shape_9", "StatefulPartitionedCall/SparseToDense_18"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/SelectV2_27", "op": "SelectV2", "input": ["StatefulPartitionedCall/Equal_9", "StatefulPartitionedCall/Shape_12", "StatefulPartitionedCall/SparseToDense_22"], "attr": {"T": {"type": "DT_INT64"}}}, {"name": "Func/StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_20/input/_56", "op": "Identity", "input": ["StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/StatefulPartitionedCall/assert_equal_1/All/_24", "^StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/pivot_f/_22"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "Func/StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_20/input/_57", "op": "Identity", "input": ["StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/StatefulPartitionedCall/LogicalAnd/_25", "^StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/pivot_f/_22"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "Func/StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_20/input/_58", "op": "Identity", "input": ["StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/StatefulPartitionedCall/assert_equal_1/y/_26", "^StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/pivot_f/_22"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Slice", "op": "StridedSlice", "input": ["input", "StatefulPartitionedCall/SparseToDense", "StatefulPartitionedCall/SelectV2_3", "StatefulPartitionedCall/SparseToDense_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Slice_1", "op": "StridedSlice", "input": ["input", "StatefulPartitionedCall/SparseToDense_3", "StatefulPartitionedCall/SelectV2_7", "StatefulPartitionedCall/SparseToDense_5"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Slice_2", "op": "StridedSlice", "input": ["input", "StatefulPartitionedCall/SparseToDense_6", "StatefulPartitionedCall/SelectV2_11", "StatefulPartitionedCall/SparseToDense_8"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Slice_3", "op": "StridedSlice", "input": ["input", "StatefulPartitionedCall/SparseToDense_10", "StatefulPartitionedCall/SelectV2_15", "StatefulPartitionedCall/SparseToDense_12"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "begin_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Slice_4", "op": "StridedSlice", "input": ["input", "StatefulPartitionedCall/SparseToDense_14", "StatefulPartitionedCall/SelectV2_19", "StatefulPartitionedCall/SparseToDense_16"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Slice_6", "op": "StridedSlice", "input": ["input", "StatefulPartitionedCall/SparseToDense_21", "StatefulPartitionedCall/SelectV2_27", "StatefulPartitionedCall/SparseToDense_23"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_20/assert_equal_1/Assert/AssertGuard/Assert", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_20/input/_56", "^Func/StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_20/input/_57", "^Func/StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_20/input/_58"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/conv1_actor/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/onnx_tf_prefix_/Slice_2", "unknown_3"], "attr": {"adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/conv2_actor/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/onnx_tf_prefix_/Slice_3", "unknown_5"], "attr": {"adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Slice_5", "op": "StridedSlice", "input": ["StatefulPartitionedCall/onnx_tf_prefix_/Slice_4", "StatefulPartitionedCall/SparseToDense_17", "StatefulPartitionedCall/SelectV2_23", "StatefulPartitionedCall/SparseToDense_19"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT64"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_20/assert_equal_1/Assert/AssertGuard/Identity_1", "op": "Identity", "input": ["Func/StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_20/input/_56", "^StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_20/assert_equal_1/Assert/AssertGuard/Assert"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/branch_executed/_28", "op": "Merge", "input": ["StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/pivot_t/_23", "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/pivot_f/_22", "^StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_20/assert_equal_1/Assert/AssertGuard/Assert"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/conv1_actor/Add", "op": "AddV2", "input": ["unknown_4", "StatefulPartitionedCall/onnx_tf_prefix_/conv1_actor/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/conv2_actor/Add", "op": "AddV2", "input": ["unknown_6", "StatefulPartitionedCall/onnx_tf_prefix_/conv2_actor/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/conv3_actor/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/onnx_tf_prefix_/Slice_5", "unknown_7"], "attr": {"adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/output/_27", "op": "Merge", "input": ["Func/StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/then/_19/output/_53", "StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/else/_20/assert_equal_1/Assert/AssertGuard/Identity_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/pivot_t/_33", "op": "Const", "input": ["^StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/branch_executed/_28"], "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/switch_pred/_31", "op": "Switch", "input": ["StatefulPartitionedCall/assert_equal_3/All", "StatefulPartitionedCall/assert_equal_3/All", "^StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/branch_executed/_28"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/onnx_tf_prefix_/conv1_actor/Add", "StatefulPartitionedCall/add_13"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/onnx_tf_prefix_/conv2_actor/Add", "StatefulPartitionedCall/add_17"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/conv3_actor/Add", "op": "AddV2", "input": ["unknown_8", "StatefulPartitionedCall/onnx_tf_prefix_/conv3_actor/MatMul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/FloorMod", "op": "Const", "input": ["^StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/output/_27"], "attr": {"value": {"tensor": {"dtype": "DT_INT64", "tensorShape": {}}}, "dtype": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Gather/axis", "op": "Const", "input": ["^StatefulPartitionedCall/assert_equal_1/Assert/AssertGuard/output/_27"], "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "Func/StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/then/_29/output/_65", "op": "Const", "input": ["^StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/pivot_t/_33"], "attr": {"value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}, "dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/pivot_f/_32", "op": "Identity", "input": ["StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/switch_pred/_31"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Reshape_2", "op": "Reshape", "input": ["StatefulPartitionedCall/onnx_tf_prefix_/conv3_actor/Add", "StatefulPartitionedCall/add_24"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT64"}}}, {"name": "StatefulPartitionedCall/onnx_tf_prefix_/Gather", "op": "GatherV2", "input": ["StatefulPartitionedCall/onnx_tf_prefix_/Slice", "StatefulPartitionedCall/FloorMod", "StatefulPartitionedCall/onnx_tf_prefix_/Gather/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT64"}, "batch_dims": {"i": "0"}}}, {"name": "Func/StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/else/_30/input/_68", "op": "Identity", "input": ["StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/StatefulPartitionedCall/assert_equal_3/All/_34", "^StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/pivot_f/_32"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "Func/StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/else/_30/input/_69", "op": "Identity", "input": ["StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/StatefulPartitionedCall/LogicalAnd_1/_35", "^StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/pivot_f/_32"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "Func/StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/else/_30/input/_70", "op": "Identity", "input": ["StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/StatefulPartitionedCall/assert_equal_3/y/_36", "^StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/pivot_f/_32"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/onnx_tf_prefix_/Gather", "StatefulPartitionedCall/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/else/_30/assert_equal_3/Assert/AssertGuard/Assert", "op": "NoOp", "input": ["^Func/StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/else/_30/input/_68", "^Func/StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/else/_30/input/_69", "^Func/StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/else/_30/input/_70"], "attr": {"_has_manual_control_dependencies": {"b": true}}}, {"name": "StatefulPartitionedCall/add_4", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/flatten/Reshape", "StatefulPartitionedCall/transpose", "StatefulPartitionedCall/mul_1"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/else/_30/assert_equal_3/Assert/AssertGuard/Identity_1", "op": "Identity", "input": ["Func/StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/else/_30/input/_68", "^StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/else/_30/assert_equal_3/Assert/AssertGuard/Assert"], "attr": {"T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/assert_equal_3/Assert/AssertGuard/branch_executed/_38", "op": "Merge", "input": 